<?php

session_start();

?>
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="author" content="voltmaister & marked-d">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>TeamSync</title>
  <link rel="stylesheet" href="../assets/styles.css">
  <script src="../assets/script.js" defer></script>
</head>
<body>
  <div id="header_container"></div>

  <?php if (isset($_SESSION['user_id'])): ?>
    <div id="navigation_container"></div>
  <?php endif;?>
  
  <main class="vertical">
    <div>
      <h1 class="center" style="font-size: xxx-large">TeamSync <span style="color: #2599ff">101</span></h1>
    </div>
    
    <div>
      <p>
        Είμαστε δίπλα σας με σκοπό να σας προσφέρουμε την καλύτερη δυνατή εμπειρία στο TeamSync. 
        Εδώ θα βρείτε απαντήσεις σε συνήθεις ερωτήσεις και θα λάβετε υποστήριξη για τυχόν προβλήματα που μπορεί να αντιμετωπίσετε.
      </p>
    </div>
    
    <div>
      <h2 class="accordion">Συχνές ερωτήσεις</h2>
      <div class="panel">
          <ul>
            <li>
              <h3>Πώς μπορώ να δημιουργήσω μια νέα λίστα εργασιών;</h3>
              <p>
                Για να δημιουργήσετε μια νέα λίστα εργασιών, κάντε κλικ στο κουμπί «Οι Λίστες μου». Κάντε κλικ στο κουμπί «Δημιουργία Λίστας» για να ολοκληρώσετε.
              </p>
            </li>
            <li>
              <h3>Πώς μπορώ να δημιουργήσω μια νέα εργασία;</h3>
              <p>
                Για να δημιουργήσετε μια νέα εργασία, κάντε κλικ στο κουμπί «Δημιουργία Εργασίας» στην επιλεγμένη λίστα εργασιών σας. Στην συνέχεια συμπληρώστε τα απαραίτητα πεδία και πατήστε το κουμπί «Δημιουργία Εργασίας».
              </p>
            </li>
            <li>
              <h3>Πώς αναθέτω μια εργασία σε έναν άλλον χρήστη;</h3>
              <p>
                Για να αναθέσετε μια εργασία σε έναν άλλο χρήστη, επιλέξτε την εργασία που θέλετε να αναθέσετε και πατήστε το κουμπί «Επεξεργασία Εργασίας». Στη συνέχεια, συμπληρώστε τον χρήστη (ξεχωρίστε του πολλούς χρήστες με κόμμα ανάμεσα) που θέλετε να αναθέσετε την εργασία και πατήστε το κουμπί «Ενημέρωση Εργασίας».
              </p>
            </li>
            <li>
              <h3>Πώς μπορώ να παρακολουθώ την πρόοδο των εργασιών;</h3>
              <p>
                Για να παρακολουθήσετε την πρόοδο των εργασιών, επιλέξτε την εργασία που θέλετε είτε μέσω της λίστας εργασιών στην οποία βρίσκεται, είτε πατήστε το κουμπί «Οι Εργασίες Μου» για να δείτε την πρόοδο όλων των εργασίων σας.
              </p>
            </li>
            <li>
              <h3>Πώς μπορώ να λαμβάνω ειδοποιήσεις στην κινητή μου συσκευή;</h3>
              <p>
                Οι ειδοποιήσεις στην κινητή σας συσκευή είναι ενεργοποιημένες με το που εγγραφείτε στο TeamSync κατά την προσθήκη του SimplePush.io Key σας. 
              </p>            
            </li>
          </ul>
      </div>
    </div>
    
    <div>
      <h2 class="accordion">Αντιμετώπιση προβλημάτων</h2>
      <div class="panel">
        <ul>
          <li>
            <h3>Δεν μπορώ να συνδεθώ στο λογαριασμό μου</h3>
            <p>
              Βεβαιωθείτε ότι χρησιμοποιείτε το σωστό email και κωδικό πρόσβασης. Εάν το πρόβλημα εξακολουθεί να υφίσταται, επικοινωνήστε με την ομάδα υποστήριξής μας.
            </p>
          </li>
          <li>
            <h3>Δεν λαμβάνω ειδοποιήσεις στην κινητή μου συσκευή</h3>
            <p>
              Βεβαιωθείτε ότι έχετε εισάγει το σωστό SimplePush.io Key στο προφίλ σας. Εάν το πρόβλημα εξακολουθεί να υφίσταται, επικοινωνήστε με την ομάδα υποστήριξής μας.
            </p>
          </li>
        </ul>
      </div>
    </div>

    <div>
      <h2 class="accordion">Επικοινωνήστε με την υποστήριξη</h2>
      <div class="panel">
        <p>Εάν χρειάζεστε περαιτέρω βοήθεια, η ομάδα υποστήριξής μας είναι εδώ για να σας βοηθήσει. Μπορείτε να επικοινωνήσετε μαζί μας μέσω των ακόλουθων:</p>
        <ul>
          <li> <b>Email:</b> <a href="mailto:support@teamsync.com">support@teamsync.com</a></li>
          <li> <b>Τηλέφωνο: </b>26610 26610</li>
        </ul>
      </div>
    </div>
    
  </main>
  <div id="footer_container"></div>
</body>
</html>