<?php

session_start();
$user_id = isset($_SESSION['user_id']) ? $_SESSION['user_id'] : null;
?>

<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta name="author" content="voltmaister & marked-d">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>TeamSync</title>
  <link rel="stylesheet" href="../assets/styles.css">
  <script src="../assets/script.js" defer></script>
</head>
<body class="blend">
  <div id="header_container"></div>
  
  <?php if ($user_id):?>
    <div>
      <nav class="center">
        <a href="../public/home.php"><button>Home</button></a>
        <a href="../public/help.html"><button>Help</button></a>
        <a href="../src/user_page.php"><button>Profile</button></a>
      </nav>
    </div>
  <?php endif;?>

  <main class="vertical">

    <div class="center">
      <h1>Καλωσήρθατε στο TeamSync</h1>
    </div>

    <div class="center">
      <h2>Συνεργασία χωρίς εμπόδια, οπουδήποτε και ανά πάσα στιγμή.</h2>
    </div>

    <div>
        <h2 class="accordion">Ενισχύστε την παραγωγικότητα της ομάδας σας</h2>
        <div class="panel">
          <p>Στο TeamSync, πιστεύουμε ότι οι σπουδαίες ομαδικές εργασίες ξεκινούν με την άψογη επικοινωνία και συνεργασία. Η πλατφόρμα μας έχει σχεδιαστεί για να φέρει την ομάδα σας κοντά και να βοηθήσει να επιτύχετε περισσότερα μαζί.</p>
        </div>
    </div>

    <div>
      <h2 class="accordion">Λειτουργίες σχεδιασμένες για επιτυχία</h2>
      <div class="panel">
        <ul>
          <li><b>Αποστολή μηνυμάτων σε πραγματικό χρόνο</b><br>
            Μείνετε συνδεδεμένοι με την ομάδα σας μέσω των άμεσων μηνυμάτων. Ανταλλάξτε ιδέες, ενημερώσεις και feedback χωρίς αναμονή.
          </li>
          <li><b>Κοινή χρήση αρχείων</b><br> 
            Ανεβάστε, ανταλλάξτε και συνεργαστείτε σε έγγραφα χωρίς δυσκολία. Διατηρήστε οργανωμένα και εύκολα προσβάσιμα όλα τα σημαντικά αρχεία σας σε ένα μέρος.
          </li><br>
          <li><b>Διαχείριση δραστηριοτήτων</b><br>
            Αναθέστε δραστηριότητες, ορίστε προθεσμίες και παρακολουθήστε την πρόοδο. Με τα έξυπνα εργαλεία διαχείρισης δραστηριοτήτων διασφαλίζουμε ότι όλοι βρίσκονται στο ίδιο μήκος κύματος.
          </li>
          <li><b>Βιντεοδιάσκεψη</b><br>
            Πραγματοποιήστε virtual συσκέψεις με βίντεο και ήχο HD. Συνεργαστείτε πρόσωπο με πρόσωπο με την ομάδα σας από οπουδήποτε.
          </li>
          <li><b>Ενσωματωμένο ημερολόγιο</b>: Προγραμματίστε συνεδριάσεις, ορίστε υπενθυμίσεις και συγχρονιστείτε με τα υπάρχοντα ημερολόγιά σας για να διατηρήσετε τον πλήρη συγχρονισμό.</li>
          <li><b>Προσαρμοσμένοι χώροι εργασίας</b>: Δημιουργήστε ειδικούς χώρους εργασίας για διαφορετικά έργα ή ομάδες. Διατηρήστε τις εργασίες σας οργανωμένες και συντονισμένες.</li>
        </ul>
      </div>
    </div>

    <div>
      <h2 class="accordion">Γιατί να επιλέξετε το TeamSync;</h2>
        <div class="panel">
          <ul>
            <li><b>Φιλική προς το χρήστη διεπαφή</b>: H πλατφόρμα μας είναι εύχρηστη, με σαφή και φιλικό σχεδιασμό που επιτρέπει εύκολη και αποτελεσματική συνεργασία.</li>
            <li><b>Ασφάλεια και αξιοπιστία</b>: Προτεραιότητα μας είναι η ασφάλεια των δεδομένων σας με προηγμένη κρυπτογράφηση και προστατευμένη αποθήκευση δεδομένων. Εμπιστευτείτε το TeamSync για την προστασία των δεδομένων σας.</li>
            <li><b>Ευελιξία και προσαρμοστικότητα</b>: Ανεξάρτητα από το εάν η ομάδα σας διαθέτει λίγα μέλη ή είστε ένας μεγάλος οργανισμός, το TeamSync προσαρμόζεται ανάλογα με τις απαιτήσεις σας.</li>
            <li><b>Υποστήριξη 24/7</b>: H εξειδικευμένη ομάδα υποστήριξής μας είναι διαρκώς στη διάθεσή σας για να σας βοηθήσει. Ζητήστε υποστήριξη οποτεδήποτε τη χρειαστείτε, μέρα ή νύχτα.</li>
          </ul>
        </div>
    </div>

    <div>
      <h2 class="accordion">Ξεκινήστε τώρα</h2>
      <div class="panel">
        <p>Γίνετε μέλος χιλιάδων ομάδων που επωφελούνται ήδη από το TeamSync. Εγγραφείτε τώρα και ανακαλύψτε πόσο απλή και αποτελεσματική μπορεί να είναι η ομαδική συνεργασία.</p>
        <a href="../public/register.html"><button>Εγγραφείτε Τώρα</button></a>
      </div>
    </div>

    </main>
  <div id="footer_container"></div>
</body>
</html>